000100180319     A          R RECORD1
000101180319     A                                  2  4USER
000102180319     A                                  2 28'Payroll Program Completed'
000103180319     A                                  2 66DATE EDTCDE(Y)
000104180319     A                                  3  4'Avinash Singh'
000105180319     A                                  5 10'Rates:'
000106180319     A                                  7 19'Day Rate:'
000107180319     A            DAYRATE        5  2   7 37EDTCDE(1)
000108180319     A                                  8 19'Afternoon Rate:'
000109180319     A            AFTNRATE       5  2   8 37EDTCDE(1)
000110180319     A                                  9 19'Night Rate:'
000111180319     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000112180319     A                                 12 11'Totals:'
000113180319     A                                 13 19'Regular Pay:'
000114180319     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000115180319     A                                 14 19'Overtime Pay:'
000116180319     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000117180319     A                                 15 19'Company Payout:'
000118180319     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000119180319     A            SHIFTTYPE     30   O 11 22
000120180319
000121180319
000122180319
000123180319
