000100180212     FHWYTOLLDSPCF   E             WORKSTN
000101180205      /FREE
000102180205                EXFMT TOLLINFO;
000103180205                       DOW NOT(*IN03);
000104180205                         EXSR SetTollRate;
000105180205                         *IN99 = *ON;
000106180205                         WRITE TOLLINFO;
000107180212                         IF KILOMETERS > 0;
000108180212                           SELECT;
000109180212                             WHEN VEHICLE = 'L';
000110180212                               EXSR TollLogicLightVehicle;
000111180212                             WHEN VEHICLE = 'H';
000112180212                               EXSR TollLogicHeavyVehicle;
000113180212                             WHEN VEHICLE = 'M';
000114180212                               EXSR TollLogicHeavyMultipleVehicle;
000115180212                           ENDSL;
000116180212                         ENDIF;
000118180205                         EXFMT SHOWTOLL;
000119180205                         *IN99 = *OFF;
000120180205                         IF *IN03 = *OFF;
000121180205                             EXSR CLEAR;
000122180205                             CLEAR TOLLINFO;
000123180205                             EXFMT TOLLINFO;
000124180205                         ENDIF;
000125180205                       ENDDO;
000126180205                     *INLR = *ON;
000127180205                RETURN;
000128180212
000129180212       BEGSR TollLogicLightVehicle;
000130180212        SELECT;
000131180212        WHEN AMPM = 'AM';
000132180212                SELECT;
000133180212                        WHEN HOUR >= 1 AND HOUR < 6;
000134180212                                TOLLRATE = 0.2162;
000135180212                        WHEN HOUR >= 6 AND HOUR < 9;
000136180212                                TOLLRATE = 0.3707;
000137180212                        WHEN HOUR >= 9 AND HOUR < 10;
000138180212                                TOLLRATE = 0.3259;
000139180212                        WHEN HOUR >= 10 AND HOUR < 12;
000140180212                                TOLLRATE = 0.2833;
000141180212                        WHEN HOUR = 12;
000142180212                                TOLLRATE = 0.2162;
000143180212                ENDSL;
000144180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000145180212                IF TRANSPDR = 'N';
000146180212                        NOTRANSP = 4.07;
000147180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000148180212                ELSE;
000149180212                        NOTRANSP = 0;
000150180212                        TOTALDUE = TOLLCHARGE;
000151180212                ENDIF;
000152180212        ENDSL;
000153180212        SELECT;
000154180212        WHEN AMPM = 'PM';
000155180212                SELECT;
000156180212                        WHEN HOUR >= 1 AND HOUR < 4;
000157180212                                TOLLRATE = 0.2833;
000158180212                        WHEN HOUR >= 4 AND HOUR < 7;
000159180212                                TOLLRATE = 0.3842;
000160180212                        WHEN HOUR >= 7 AND HOUR < 12;
000161180212                                TOLLRATE = 0.2162;
000162180212                        WHEN HOUR = 12;
000163180212                                TOLLRATE = 0.2833;
000164180212                ENDSL;
000165180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000166180212                IF TRANSPDR = 'N';
000167180212                        NOTRANSP = 4.07;
000168180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000169180212                ELSE;
000170180212                        NOTRANSP = 0;
000171180212                        TOTALDUE = TOLLCHARGE;
000172180212                ENDIF;
000173180212        ENDSL;
000174180212       ENDSR;
000175180212
000176180212       BEGSR TollLogicHeavyVehicle;
000178180212        SELECT;
000179180212        WHEN AMPM = 'AM';
000180180212                SELECT;
000181180212                        WHEN HOUR >= 1 AND HOUR < 6;
000182180212                                TOLLRATE = 0.4324;
000183180212                        WHEN HOUR >= 6 AND HOUR < 9;
000184180212                                TOLLRATE = 0.7418;
000185180212                        WHEN HOUR >= 9 AND HOUR < 10;
000186180212                                TOLLRATE = 0.6518;
000187180212                        WHEN HOUR >= 10 AND HOUR < 12;
000188180212                                TOLLRATE = 0.5666;
000189180212                        WHEN HOUR = 12;
000190180212                                TOLLRATE = 0.4324;
000191180212                ENDSL;
000192180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000193180212                IF TRANSPDR = 'N';
000194180212                        NOTRANSP = 4.07;
000195180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000196180212                ELSE;
000197180212                        NOTRANSP = 0;
000198180212                        TOTALDUE = TOLLCHARGE;
000199180212                ENDIF;
000200180212        ENDSL;
000201180212        SELECT;
000202180212        WHEN AMPM = 'PM';
000203180212                SELECT;
000204180212                        WHEN HOUR >= 1 AND HOUR < 4;
000205180212                                TOLLRATE = 0.5666;
000206180212                        WHEN HOUR >= 4 AND HOUR < 7;
000207180212                                TOLLRATE = 0.7683;
000208180212                        WHEN HOUR >= 7 AND HOUR < 12;
000209180212                                TOLLRATE = 0.4324;
000210180212                        WHEN HOUR = 12;
000211180212                                TOLLRATE = 0.5666;
000212180212                ENDSL;
000213180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000214180212                IF TRANSPDR = 'N';
000215180212                        NOTRANSP = 4.07;
000216180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000217180212                ELSE;
000218180212                        NOTRANSP = 0;
000219180212                        TOTALDUE = TOLLCHARGE;
000220180212                ENDIF;
000221180212        ENDSL;
000222180212       ENDSR;
000223180212
000224180212             BEGSR TollLogicHeavyMultipleVehicle;
000227180212        SELECT;
000228180212        WHEN AMPM = 'AM';
000229180212                SELECT;
000230180212                        WHEN HOUR >= 1 AND HOUR < 6;
000231180212                                TOLLRATE = 0.6486;
000232180212                        WHEN HOUR >= 6 AND HOUR < 9;
000233180212                                TOLLRATE = 1.1122;
000234180212                        WHEN HOUR >= 9 AND HOUR < 10;
000235180212                                TOLLRATE = 0.9778;
000236180212                        WHEN HOUR >= 10 AND HOUR < 12;
000237180212                                TOLLRATE = 0.8499;
000238180212                        WHEN HOUR = 12;
000239180212                                TOLLRATE = 0.6486;
000240180212                ENDSL;
000241180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000242180212                IF TRANSPDR = 'N';
000243180212                        NOTRANSP = 4.07;
000244180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000245180212                ELSE;
000246180212                        NOTRANSP = 0;
000247180212                        TOTALDUE = TOLLCHARGE;
000248180212                ENDIF;
000249180212        ENDSL;
000250180212        SELECT;
000251180212        WHEN AMPM = 'PM';
000252180212                SELECT;
000253180212                        WHEN HOUR >= 1 AND HOUR < 4;
000254180212                                TOLLRATE = 0.8499;
000255180212                        WHEN HOUR >= 4 AND HOUR < 7;
000256180212                                TOLLRATE = 1.1525;
000257180212                        WHEN HOUR >= 7 AND HOUR < 12;
000258180212                                TOLLRATE = 0.6486;
000259180212                        WHEN HOUR = 12;
000260180212                                TOLLRATE = 0.8499;
000261180212                ENDSL;
000262180212                TOLLCHARGE = KILOMETERS * TOLLRATE;
000263180212                IF TRANSPDR = 'N';
000264180212                        NOTRANSP = 4.07;
000265180212                        TOTALDUE = TOLLCHARGE + NOTRANSP;
000266180212                ELSE;
000267180212                        NOTRANSP = 0;
000268180212                        TOTALDUE = TOLLCHARGE;
000269180212                ENDIF;
000270180212        ENDSL;
000271180212       ENDSR;
000272180212
000273180212
000274180212
000837180205       BEGSR SetTollRate;
000838180205         TOLLRATE = .9999;
000839180205         TOLLCHARGE = 99;
000840180205         NOTRANSP = 9.99;
000841180205         TOTALDUE = 999.99;
000842180205       ENDSR;
000843180205
000844180205       BEGSR CLEAR;
000845180205         TOLLRATE = 0;
000846180205         TOLLCHARGE = 0;
000847180205         NOTRANSP = 0;
000848180205         TOTALDUE = 0;
000849180205       ENDSR;
