000001180308             PGM
000002180308             CALL       STRJOB
000003180312             ADDLIBLE   SENECAPAY
000004180308             DSPSYSLVL  *DISPLAY
000005180308             MONMSG     CPF2103
000006180308             ENDPGM
