000100180402     A          R WORKWEEK1                 PFILE(WORKWEEK1)
000101180402     A          K EMPNUM
000102180402     A          K WORKSHIFT
000103180402     A          K HRSWORKED
