000100180402     A          R WORKWEEK2                 PFILE(WORKWEEK2)
000101180402     A          K EMPNUM
000102180402     A          K WORKSHIFT
000103180402     A          K HRSWORKED
